app/views/instructor/index.html.haml

SELECT  "instructors".* FROM "instructors"  WHERE (status = 'Current')  ORDER BY "instructors"."name" ASC LIMIT 0
---
    %ul
      - Instructor.order(:name).where("status = 'Current'").first(@instructors.size).each  do |instructor|