app/controllers/evaluation_controller.rb

  def index
    if can? :read, :all

      selected_instructor = params[:instructor];
      selected_course = params[:course_name];
      selected_year = params[:year];
      selected_semester = params[:semester];


      if selected_year.nil? || selected_semester.nil?
        yr_smstr = Evaluation.no_missing_data.pluck(:term).uniq.sort.reverse.first
---
SELECT "evaluations"."term" FROM "evaluations"  WHERE (NOT (instructor_id is NULL OR enrollment is NULL OR item1_mean is NULL OR item2_mean is NULL OR item3_mean is NULL OR item4_mean is NULL OR item5_mean is NULL OR item6_mean is NULL OR item7_mean is NULL OR item8_mean is NULL))

  def edit
    if can? :write, :all
      @evaluation = Evaluation.find(evaluation_id)
---
SELECT  "evaluations".* FROM "evaluations"  WHERE "evaluations"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    @evaluation = Evaluation.find(evaluation_id)
    key_string = @evaluation.key.values.map(&:to_s).join("-")
    @evaluation.destroy
---
SELECT  "evaluations".* FROM "evaluations"  WHERE "evaluations"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "evaluations" WHERE "evaluations"."id" = ?  [["id", 1]]

  def update
    @evaluation = Evaluation.find(evaluation_id)
---
SELECT  "evaluations".* FROM "evaluations"  WHERE "evaluations"."id" = ? LIMIT 1  [["id", 1]]