app/controllers/instructor_controller.rb

  def index
    # return the instructors in sorted order by last name
    instructors_with_enrollment_data = Evaluation.no_missing_data.pluck(:instructor_id).uniq
    @instructors =Instructor.where(id: instructors_with_enrollment_data).sort { |a, b| a.name.split(" ").last <=> b.name.split(" ").last }
---
SELECT "evaluations"."instructor_id" FROM "evaluations"  WHERE (NOT (instructor_id is NULL OR enrollment is NULL OR item1_mean is NULL OR item2_mean is NULL OR item3_mean is NULL OR item4_mean is NULL OR item5_mean is NULL OR item6_mean is NULL OR item7_mean is NULL OR item8_mean is NULL))
SELECT "instructors".* FROM "instructors"  WHERE "instructors"."id" IN (1, 2, 3)

  def show
    @instructor = Instructor.find(id)
---
SELECT  "instructors".* FROM "instructors"  WHERE "instructors"."id" = ? LIMIT 1  [["id", 1]]

  def export
    instructor = Instructor.find(id)
---
SELECT  "instructors".* FROM "instructors"  WHERE "instructors"."id" = ? LIMIT 1  [["id", 1]]